# ***********ЗАДАЧА №1************************
# Реализовать алгоритм пузырьковой сортировки.
a = [4, 1, 2, 7, 6, 9, 3, 5, 8]
j = 0

while j < len(a):
    i = 0
    while i < len(a)-j-1:
        if a[i] > a[i + 1]:
            a[i], a[i + 1] = a[i + 1], a[i]
        i += 1
        # print(a)
    j += 1
print(a)

# ----FOR----
dlist = [19, 1, 9, 7, 3, 10, 13, 15, 8, 12]

for sortbubble in range(len(dlist)-1, 0, -1):
    for i in range(sortbubble):
        if dlist[i] > dlist[i+1]:
            dlist[i], dlist[i + 1] = dlist[i + 1], dlist[i]
            # print(dlist)
print(dlist)
'''
# *************************ЗАДАЧА №2******************************
Написать программу которая просит у пользователя ввести его любимое число.
# Если ввод число, тогда поблагодорить пользователя за сотрудничество и
# завершить программу.
# Если ввод не число, тогда попросить его быть более внимательным и ввести 
# именно число.
Если неправильный ввод более 3 раз, перейти на более грубое предупреждение.
Если неправильный ввод более 5 раз, дать пользователю последний шанс.
Если ввод по прежнему не число, тогда обругать пользователя и завершить программу.
'''
# *******ЗАДАЧА №2****
cont_vvod = 0
while True:
    user_digit = input('Enter your like number... ')

    if user_digit.isdigit() is False:
        cont_vvod += 1
        if cont_vvod < 3:
            print(f'Будьте уважні потрібно ввести тільки число!')
        elif 2 < cont_vvod < 5:
            print(f'Зроби це нарешті, введи число!')
        elif 4 < cont_vvod < 6:
            print(f"Тобі капець, останній шанс або число або ...!")
        elif cont_vvod == 6:
            print(f"Все набридло тоді казати пока!!!")
            break
    else:
        print(f"Дякуємо за співпрацю Ваше щасливе число {user_digit}!")
        break







